# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'
tap 'homebrew/cask-fonts'

# Install ZSH
brew 'zsh-syntax-highlighting'

# Install Binaries
brew 'mas'
brew 'node'
brew 'elixir'
brew 'emacs-plus'

# Development
cask 'sourcetree'
cask 'visual-studio-code'

# Apps
cask 'font-source-code-pro'
cask 'alfred'
cask 'google-chrome'
cask 'iTerm2'
cask 'kdiff3'
cask 'slack'
cask 'spotify'
cask 'spotmenu'
cask 'the-unarchiver'
cask 'toggl'
cask 'vlc'

# Install Mac App Store apps
mas 'Battery Health', id: 490192174
mas 'DevCleaner', id: 1388020431
mas 'GIPHY CAPTURE', id: 668208984
mas 'OneDrive', id: 823766827
mas 'Sip', id: 507257563
mas 'Snap', id: 418073146
mas 'TweetDeck', id: 485812721
mas '1Password', id: 1333542190
mas 'Kindle', id: 405399194
mas 'Magnet', id: 441258766
mas 'Amphetamine', id: 937984704
mas 'Whatsapp', id: 1147396723
mas 'Keynote', id: 409183694